TICKERS = {
    # 미국 주식 및 ETF
    "JEPQ": "JEPQ",
    "SCHD": "SCHD",
    "O": "O",
    "GPIX": "GPIX",  # <--- GPIX 추가

    # 한국 주식 & ETF
    "SK하이닉스": "000660.KS",
    "현대차2우B": "005387.KS",
    "삼성전자": "005930.KS",
    "삼성전자우": "005935.KS",
    "삼성SDI": "006400.KS",
    "두산에너빌리티": "034020.KS",
    "TIME 미국나스닥100액티브": "426030.KS",
    "TIGER 배당커버드콜액티브": "472150.KS",

    # 티커 호환용
    "000660.KS": "000660.KS",
    "005387.KS": "005387.KS",
    "005930.KS": "005930.KS",
    "005935.KS": "005935.KS",
    "006400.KS": "006400.KS",
    "034020.KS": "034020.KS",
    "426030.KS": "426030.KS",
    "472150.KS": "472150.KS"
}
